Revit 2027 API
ParameterTypeId.RebarSystemBarTypeFrontDirn1 Property
 "Exterior Major Bar Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemBarTypeFrontDirn1 { get; }
Public Shared ReadOnly Property RebarSystemBarTypeFrontDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemBarTypeFrontDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemBarTypeFrontDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace